Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ndex"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1892637356" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1737541552971647000" -> "1744630980874730200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:28",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250114060856368300000003"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1360573309" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215871723800" -> "1744630989090904000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:28",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "824640816" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739852542358284000" -> "1744630990275592000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1284265821" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899413273000" -> "1744630987983476000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-0"
        name        = "sbeacon-backend-indexer-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003/*",
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:28",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250114060856368300000003"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1963275125" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899548222000" -> "1744630983710639000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1027390844" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899816348000" -> "1744630980393258000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "882987626" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780900556596000" -> "1744630983293187000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-1"
        name        = "sbeacon-backend-submitDataset-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003/*",
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:96601faddf3395e2444c5c3f1340d516f601f0127e6cc9697f8f4ff72cc46382" -> (known after apply)
      ~ last_modified                  = "2025-03-24T01:58:56.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250114060856368300000003"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
              - "REGION"                               = "ap-southeast-3"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-updateFiles:sbeacon-backend-updateFiles"
        name        = "sbeacon-backend-updateFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-vcfs"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1228683169" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780898785767000" -> "1744630987781893000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/sbeacon.python_libraries_layer/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = null
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/root/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/143/default"
                  + module = ".terraform/modules/sbeacon.python_libraries_layer"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = null
          + "source_path"              = "\"sbeacon/layers/python_libraries/\""
        }
      + result  = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:28" -> (known after apply)
      ~ code_sha256                 = "2Lq7GazaziiPwLxBMnYKTHYFesgHhT7vSI2OUY5avAs=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-04-11T10:08:07.626+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:28" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_bucket                   = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      ~ s3_key                      = "builds/0ea3d43aecc6da766a8d5718b816ef9e98018e75b39585b712fa8086b03f748c.zip" -> (known after apply) # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply) # forces replacement
      ~ source_code_size            = 23527489 -> (known after apply)
      ~ version                     = "28" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250114060855521800000001/builds/0ea3d43aecc6da766a8d5718b816ef9e98018e75b39585b712fa8086b03f748c.zip" -> (known after apply)
      ~ bucket                        = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "7b5e34f019fa4eb69c6f746c136f157d-5" -> (known after apply)
      ~ id                            = "builds/0ea3d43aecc6da766a8d5718b816ef9e98018e75b39585b712fa8086b03f748c.zip" -> (known after apply)
      ~ key                           = "builds/0ea3d43aecc6da766a8d5718b816ef9e98018e75b39585b712fa8086b03f748c.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/0ea3d43aecc6da766a8d5718b816ef9e98018e75b39585b712fa8086b03f748c.zip" -> (known after apply)
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "334212190" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0ea3d43aecc6da766a8d5718b816ef9e98018e75b39585b712fa8086b03f748c.zip" -> (known after apply)
          ~ "timestamp" = "1744365857884746000" -> (known after apply)
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41" -> (known after apply)
      ~ code_sha256                 = "3zlBn4K1EldyD5EqFMcdcC5eciVWy3k/1DNw2ZCUJp8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-03-24T01:52:19.526+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_bucket                   = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 36681 -> (known after apply)
      ~ version                     = "41" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250114060855521800000001/builds/4c759ac6c770aa93ab5a3cecb6e53139bf8189f8e8f20becefb22aa5139b13ea.zip" -> (known after apply)
      ~ bucket                        = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "1c81caa0eb2765445c2b575a0930a5d1" -> (known after apply)
      ~ id                            = "builds/4c759ac6c770aa93ab5a3cecb6e53139bf8189f8e8f20becefb22aa5139b13ea.zip" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "683044983" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899732176000" -> "1744630984675571000"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1200695035" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1740987235186741200" -> "1744630983499255800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:ca6083e9f25c398a31bcc8bb74328ca65fb353c75d172203023c7b2cc59f4f61209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:ca6083e9f25c398a31bcc8bb74328ca65fb353c75d172203023c7b2cc59f4f61" -> (known after apply)
        name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "f9f305e25f55ff09adf2837e1ebee32310bc2010" -> "e9a9a2616588572626e723fb28e433caacbbf122"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_arg       = {} -> null
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (10 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (10 unchanged attributes hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:9f579649e7d47b2ddea4f348eff0f467490a3bd2a4bd523045b2a472ea3c42a7" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:9f579649e7d47b2ddea4f348eff0f467490a3bd2a4bd523045b2a472ea3c42a7" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "f9f305e25f55ff09adf2837e1ebee32310bc2010" -> "e9a9a2616588572626e723fb28e433caacbbf122"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-clearTempAndRegions.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/07b2ba2a58d72e49b5f6122bfc7843c73f7c04840c3d0c6d5b524f158de272b0.zip" -> "builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.zip"
        id                             = "svep-backend-clearTempAndRegions"
      ~ last_modified                  = "2025-04-10T07:07:10.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "svep-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-clearTempAndRegions.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/clearTempAndRegions",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.plan.json"
      + id                   = (known after apply)
    }

  # module.svep.module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1462274430" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/07b2ba2a58d72e49b5f6122bfc7843c73f7c04840c3d0c6d5b524f158de272b0.zip" -> "builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.zip"
          ~ "timestamp" = "1744260802241986000" -> "1744630983292112200"
        }
    }

  # module.svep.module.lambda-concat.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concatPages.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-concatPages"
        name             = "svep-backend-concatPages"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-concatPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "CONCATPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "RESULT_SUFFIX"                 = "_results.tsv"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250103055725292400000005"
              - "SVEP_RESULTS"                  = "gaspi-dataportal-20250120051259130100000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_TPJOWHZvH"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concatStarter.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-createPages.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-createPages"
        name             = "svep-backend-createPages"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-createPages",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/clinical-workflows/*",
                        ]
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-createPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "CONCATPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages"
              - "CREATEPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-createPages"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250103055725292400000005"
              - "SVEP_RESULTS"                  = "gaspi-dataportal-20250120051259130100000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_TPJOWHZvH"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-formatOutput.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-formatOutput/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e494bef938167ef6895199d5aa2d39193dd1b2855bb4e11843334ec2c38429d0.zip' 'python3.12' '/root/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/143/default/svep/lambda/formatOutput'"
          + "filename_new"   = "builds/e494bef938167ef6895199d5aa2d39193dd1b2855bb4e11843334ec2c38429d0.zip"
          + "filename_old"   = "builds/e494bef938167ef6895199d5aa2d39193dd1b2855bb4e11843334ec2c38429d0.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-formatOutput"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-formatOutput.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-formatOutput"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "SNS:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
                    },
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  + {
                      + Action   = "cognito-idp:ListUsers"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep.module.lambda-formatOutput.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-formatOutput-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-formatOutput:*:*",
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-formatOutput:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep.module.lambda-formatOutput.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-formatOutput"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-formatOutput",
        ]
    }

  # module.svep.module.lambda-formatOutput.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-formatOutput-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-formatOutput",
        ]
    }

  # module.svep.module.lambda-formatOutput.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-formatOutput"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep.module.lambda-formatOutput.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Convert input list of dictionaries to a TSV file."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-formatOutput"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                       = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              + "COLUMNS"                       = "rank,region,alt,consequence,geneName,geneId,feature,transcriptId,transcriptBiotype,exonNumber,aminoAcids,codons,strand,transcriptSupportLevel,ref,gt,qual,filter,variationId,rsId,omimId,classification,conditions,clinSig,reviewStatus,lastEvaluated,accession,pubmed"
              + "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              + "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              + "SVEP_REGIONS"                  = "svep-backend-regions-20250103055725292400000005"
              + "SVEP_TEMP"                     = "svep-backend-temp-20250103055724965800000004"
              + "USER_POOL_ID"                  = "ap-southeast-3_TPJOWHZvH"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep.module.lambda-formatOutput.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/e494bef938167ef6895199d5aa2d39193dd1b2855bb4e11843334ec2c38429d0.zip"
        }
    }

  # module.svep.module.lambda-getResultsURL.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-getResultsURL"
        name             = "svep-backend-getResultsURL"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",

```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.